; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	thermograph6 - mode
	image2 - mode
	thermograph1 - mode
	image3 - mode
	spectrograph5 - mode
	infrared4 - mode
	infrared0 - mode
	Star1 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation5 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph6)
	(supports instrument0 image2)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph6)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 thermograph6)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 thermograph6)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument5 image3)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 Star1)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation7)
	(supports instrument7 spectrograph5)
	(calibration_target instrument7 GroundStation6)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument8 thermograph1)
	(supports instrument8 image2)
	(supports instrument8 infrared4)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 GroundStation7)
	(supports instrument9 thermograph6)
	(calibration_target instrument9 GroundStation7)
	(supports instrument10 infrared0)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 GroundStation4)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument11 thermograph6)
	(calibration_target instrument11 GroundStation5)
	(calibration_target instrument11 Star2)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon10)
)
(:goal (and
	(pointing satellite0 Planet11)
	(pointing satellite1 GroundStation3)
	(pointing satellite2 GroundStation0)
	(have_image Star8 image2)
	(have_image Star8 thermograph6)
	(have_image Star9 infrared4)
	(have_image Phenomenon10 image2)
	(have_image Phenomenon10 infrared0)
	(have_image Planet11 image3)
	(have_image Planet12 image3)
	(have_image Planet12 spectrograph5)
))

)

; plan
1. (turn_to satellite2 groundstation3 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 11
2. (turn_to satellite0 groundstation7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 11
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 11
4. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 0 of 11
5. (turn_to satellite0 star9 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star9)
   goals met: 0 of 11
6. (take_image satellite0 star9 instrument1 infrared4)
   added: (have_image star9 infrared4)
   goals met: 1 of 11
7. (turn_to satellite0 phenomenon10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 11
8. (take_image satellite0 phenomenon10 instrument1 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 2 of 11
9. (turn_to satellite0 star2 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star2)
   goals met: 2 of 11
10. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 2 of 11
11. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 11
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 11
13. (calibrate satellite2 instrument7 groundstation3)
   added: (calibrated instrument7)
   goals met: 2 of 11
14. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 11
15. (turn_to satellite0 phenomenon10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 11
16. (take_image satellite0 phenomenon10 instrument0 image2)
   added: (have_image phenomenon10 image2)
   goals met: 3 of 11
17. (turn_to satellite0 planet12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet12)
   goals met: 3 of 11
18. (take_image satellite0 planet12 instrument0 image3)
   added: (have_image planet12 image3)
   goals met: 4 of 11
19. (turn_to satellite0 star8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star8)
   goals met: 4 of 11
20. (take_image satellite0 star8 instrument0 image2)
   added: (have_image star8 image2)
   goals met: 5 of 11
21. (take_image satellite0 star8 instrument0 thermograph6)
   added: (have_image star8 thermograph6)
   goals met: 6 of 11
22. (turn_to satellite0 planet11 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet11)
   goals met: 7 of 11
23. (take_image satellite0 planet11 instrument0 image3)
   added: (have_image planet11 image3)
   goals met: 8 of 11
24. (turn_to satellite1 groundstation3 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation3)
   goals met: 9 of 11
25. (turn_to satellite2 planet12 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet12)
   goals met: 9 of 11
26. (take_image satellite2 planet12 instrument7 spectrograph5)
   added: (have_image planet12 spectrograph5)
   goals met: 10 of 11
27. (turn_to satellite2 groundstation0 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 groundstation0)
   goals met: 11 of 11
